{"title": "Statement from Pamela Gavin, CEO, National Organization for Rare Disorders (NORD) on the Senate Failure to Approve the Give Kids a Chance Act By Year-End", "date": "2025-12-18", "author": "sroberts", "categories": ["Advocacy", "Featured News"], "content": "Posted December 18, 2025 by NORD\n\nThe Senate’s failure to advance the Give Kids a Chance Act through unanimous consent is deeply disappointing.\n\nFor more than a year, thousands of rare disease advocates have engaged lawmakers across both parties to urge passage of the Give Kids a Chance Act, which includes reauthorization of the Rare Pediatric Disease Priority Review Voucher Program and passage of other critical policies for children with rare conditions. This legislation has broad bipartisan support, is budget-neutral, and has a proven track record of accelerating the development of treatments for children who often have no other options.\n\nAllowing this bill to expire slows and risks halting progress for families who are already waiting far too long for diagnoses and therapies. For children with rare diseases, delays are not abstract. They are measured in irreversible losses of physical body functions, neurological damage, time, and life itself.\n\nAt a time when our nation needs leaders to come together and set aside differences to do what is right, it is unfortunate that this opportunity was missed. This could have been a meaningful victory for more than 30 million Americans living with rare diseases.\n\nWhen the Senate returns in January, NORD will be back on Capitol Hill working with lawmakers in both chambers to move this legislation forward without delay. The rare disease community has been clear, consistent, and united. We urge Congress to act swiftly to ensure that children with rare diseases are not left behind.", "url": "https://rarediseases.org/statement-from-pamela-gavin-ceo-national-organization-for-rare-disorders-nord-on-the-senate-failure-to-approve-the-give-kids-a-chance-act-by-year-end/", "summary": "Posted December 18, 2025 by NORD\n\nThe Senate’s failure to advance the Give Kids a Chance Act through unanimous consent is deeply disappointing.\n\nFor more than a year, thousands of rare disease advocat...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T15:47:58.335493", "content_length": 1543}
{"title": "NORD CEO Statement on the Addition of Metachromatic Leukodystrophy (MLD) and Duchenne Muscular Dystrophy (DMD) to the Recommended Uniform Screening Panel", "date": "2025-12-16", "author": "Connor Rice", "categories": ["Advocacy", "Featured News", "Newborn Screening"], "content": "Posted December 16, 2025 by NORD\n\nNewborn Screening\n\nThe National Organization for Rare Disorders (NORD) applauds the Department of Health and Human Services (HHS) for addingmetachromatic leukodystrophy (MLD)andDuchenne muscular dystrophy (DMD)to the Recommended Uniform Screening Panel (RUSP). MLD and DMD are both serious rare conditions that have taken the lives of too many children and young adults.\n\nNewborn screening is a vital public health program with a long history of successful operation in the United States. Over 14,000 newborns are found to have a serious but treatable rare disorder through newborn screening each year.1Babies affected by these conditions appear healthy at birth, and families are often unaware that anything is wrong until after a child becomes symptomatic. Screening shortly after birth will allow for early detection and intervention, a move that will save lives and give newborns affected by MLD and DMD the best shot at a healthy life. We congratulate the leukodystrophy and muscular dystrophy communities, whose tireless advocacy has driven these nominations forward through months of uncertainty.\n\nWhile newborn screening programs operate at the state/territory level, the federal government plays a critical role in supporting efficiency and transparency for our nation’s newborn screening system. States ultimately determine which conditions are screened as part of their respective newborn screening programs, but inclusion on the RUSP is an important step in ensuring newborns are universally screened for a particular condition. NORD is grateful for Secretary Kennedy’s decision to add MLD and DMD to the recommended panel, a decision that marks an important step toward universal screening for these two conditions across the country.\n\nIt is critical that the important work of evaluating nominations to the RUSP, reviewing evidence, and making recommendations to the Secretary does not end with these two conditions.\n\nWe are hopeful that the Administration will continue to hear the voice of the rare community, and we remain steadfast in our commitment to work with policymakers on both sides of the aisle to determine a path forward for this lifesaving work. As new treatments and improved screening methods become available, we must ensure thatall newborns born in the United States can benefit from early detection and treatment.\n\nTo build upon this momentum, NORD calls on Congress to build off this important milestone to further strengthen the nation’s newborn screening system by passing the Newborn Screening Saves Lives Reauthorization Act.\n\nThis bipartisan legislation would strengthen and modernize the nation’s newborn screening system, provide long-term stability for the RUSP, and ensure that states, clinicians, and families have clear, consistent guidance. By codifying these efforts, Congress can help ensure that progress made today translates into durable, nationwide impact, so that every newborn, regardless of where they are born, has the same opportunity for early diagnosis and timely care.Advocates are encouraged to contact their lawmakers in support of this bill usingNORD’s action alert here.\n\nPamela GavinChief Executive OfficerNational Organization for Rare Disorders (NORD)\n\n[1] Gaviglio A, McKasson S, Singh S, Ojodu J. Infants with Congenital Diseases Identified through Newborn Screening-United States, 2018-2020. Int J Neonatal Screen. 2023;9(2):23. Published 2023 Apr 13. doi:10.3390/ijns9020023", "url": "https://rarediseases.org/nord-ceo-statement-on-the-addition-of-metachromatic-leukodystrophy-mld-and-duchenne-muscular-dystrophy-dmd-to-the-recommended-uniform-screening-panel/", "summary": "Posted December 16, 2025 by NORD\n\nNewborn Screening\n\nThe National Organization for Rare Disorders (NORD) applauds the Department of Health and Human Services (HHS) for addingmetachromatic leukodystrop...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T15:49:04.282133", "content_length": 3480}
{"title": "America’s Rare Children Need Congress to Act: NORD Urges Swift Reauthorization of Proven Rare Pediatric Disease Voucher Program", "date": "2025-12-04", "author": "Connor Rice", "categories": ["Advocacy", "Featured News", "Press Releases"], "content": "Posted December 4, 2025 by NORD\n\nNORD report shows 63 FDA vouchers driving breakthroughs for 47 rare pediatric diseases, 43 with no prior treatments — unprecedented progress for children left behind\n\nWASHINGTON, Dec. 4, 2025— The National Organization for Rare Disorders (NORD®) today urged Congress to reauthorize the Rare Pediatric Disease Priority Review Voucher (RPD PRV) program by year-end, warning that continued delay threatens the future of innovation for children with rare diseases.\n\nOn Dec. 1, the U.S. House of Representatives passed the Give Kids a Chance Act (H.R. 1262 /S. 932), an important step forward in protecting incentives for rare pediatric drug development. The bill will now move to the Senate for consideration.\n\nAccording to NORD’s original research, the Food and Drug Administration (FDA) has awarded 63 vouchers since the program’s creation in 2012, leading to treatments for 47 rare pediatric diseases, 43 of which previously had no treatment options. More than half of all designations have occurred in just the past five years, underscoring the program’s growing impact and bringing real hope to the more than 15 million children living with a rare pediatric disease, 30% of whom will not live to see their fifth birthday.\n\nUrgency to Reauthorize\n\nWith the FDA’s authority to grant rare pediatric designations expiring in 2024, and its authority to grant priority review vouchers expiring on Sept. 30, 2026, the delay in reauthorization fuels uncertainty in the marketplace for investors and pediatric drug developers.\n\n“The PRV program has been instrumental in encouraging the development of new therapies for rare pediatric diseases. Since its inception in 2012, this program’s success has resulted in more American children with rare diseases having a chance at a fuller, healthier life, and gives hope to communities still waiting for a treatment option for their condition. Congress must move on reauthorization now.  Timely restoration of the program will provide needed certainty within the U.S. pediatric treatment marketplace and prevent devastating consequences for children with rare diseases who are waiting for new treatments,”said Rep. Gus Bilirakis (R-Fla.), an original cosponsor of the Give Kids a Chance Act (H.R. 1262).\n\n“Every day without reauthorization creates uncertainty that disrupts research and delays innovation,”said Pamela K. Gavin, NORD Chief Executive Officer. “That uncertainty puts both hope and progress at risk for children with life-threatening rare diseases who simply cannot afford to wait.  Congress has a clear choice: reauthorize a program that works or allow progress to stall for kids who have no other options.”\n\n“The RPD PRV is the most important incentive for developing new therapies for ultra-rare neuromuscular diseases. Already, we have seen investors and companies shy away from developing life-changing treatments for our ultra-rare community, and without rapid reauthorization, it will only get worse. MDA joins the rare disease community in calling for the program’s immediate reauthorization,”said Paul Melmeyer, EVP, Public Policy and Advocacy, Muscular Dystrophy Association.\n\nNORD, in a white paper titled“Impact of the Rare Pediatric Disease Priority Review Voucher Program on Drug Development 2012 – 2025,”confirms the RPD PRV program is a measured, effective incentive that accelerates development for rare pediatric conditions.\n\nIn 2025 alone, four vouchers were granted for life-saving therapies addressing severe rare diseases such as neurofibromatosis type 1, diffuse midline glioma with H3 K27M mutation, Barth syndrome and thymidine kinase 2 deficiency (TK2d).\n\n29 RPD PRVs have been redeemed for priority review of 26 different drugs for a variety of diseases, including eight drugs to treat rare diseases.\n\nOf the top 50 Medicare-spend drugs in 2023, only three were approved through a redeemed voucher and fewer than half were among the top 100 in Medicare Parts B or D spend.\n\n“In 2023, the Friedreich’s ataxia (FA) community saw a long-awaited breakthrough: the first and only FDA-approved treatment for a progressive, life-shortening disease that begins in childhood and affects about 4,000 people in the U.S. This therapy offers meaningful improvements in stability, coordination, and fatigue, bringing families hope where there had been none,”said Jennifer Farmer, Friedreich’s Ataxia Research Alliance, Chief Executive Officer. “This milestone may not have been possible without the Rare Pediatric Disease Priority Review Voucher program,” added Farmer.\n\nA Bipartisan Opportunity\n\nNORD is calling on lawmakers to pass the bipartisan Give Kids a Chance Act before year-end, extending the program for at least another five years. “A year-end reauthorization would be a bipartisan victory,” said NORD’s Gavin. “America’s rare children cannot afford another month of inaction.”\n\n“Lennox-Gastaut Syndrome (LGS) is a devastating childhood epilepsy, and for years, families had no options. The PRV program finally drove investment in treatments that would otherwise never have been developed,”said Tracy Dixon-Salazar, LGS Foundation Executive Director. “These therapies don’t just improve quality of life; they help prevent lifelong disability, reduce medical crises, and ease enormous emotional and financial strain,” added Dixon-Salazar.\n\nThe Give Kids a Chance Act would extend the Rare Pediatric Disease Priority Review Voucher program for at least five more years, protecting one of the few incentives proven to drive new treatments for children with rare diseases. The House passed its version on Dec. 1, but the Senate must act quickly to keep this lifesaving program alive.\n\nUrge your Senators to support the Give Kids a Chance Act and help ensure continued breakthroughs for kids who urgently need them.Act with a NORD Action Alerthere.\n\nFull NORD RPD PRV Report:HERE\n\nOne-Pager Summary:HERE\n\nNORD Action Alert:HERE\n\nFounded in 1983, the National Organization for Rare Disorders (NORD®) is the leading independent nonprofit dedicated to improving the health and lives of the 30+ million Americans living with rare diseases. In partnership with more than 350 member organizations, NORD drives policy, research, education, and patient support nationwide.\n\nMedia Contact:Cheryl HerbertVice President, Marketing & Communications, NORDcherbert@rarediseases.org| (719) 330-4053", "url": "https://rarediseases.org/nord-urges-swift-reauthorization-of-proven-rare-pediatric-disease-voucher-program/", "summary": "Posted December 4, 2025 by NORD\n\nNORD report shows 63 FDA vouchers driving breakthroughs for 47 rare pediatric diseases, 43 with no prior treatments — unprecedented progress for children left behind\n\n...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T15:51:13.137232", "content_length": 6384}
{"title": "Public Affairs and Patient Advocacy Leader Kim Isenberg Joins National Organization for Rare Disorders Board of Directors", "date": "2025-12-08", "author": "Connor Rice", "categories": ["Media Center", "Press Releases"], "content": "Posted December 8, 2025 by NORD\n\nNORWELL, Mass.,Dec. 8, 2025—The National Organization for Rare Disorders (NORD®), a leading rare disease patient advocacy organization, today announced the appointment of Kim Isenberg, a retired industry veteran with more than three decades of public affairs and patient advocacy experience, to its Board of Directors.\n\nIsenberg is a veteran rare disease leader whose career spans the full ecosystem of progress, from health care policy and drug development to patient advocacy and the business strategies that bring new treatments to market. With this depth of experience, she brings a powerful, integrated perspective that enhances NORD’s ability to drive meaningful impact.\n\n“Kim Isenberg has spent her career ensuring that rare disease communities are heard and that the systems shaping their care are responsive to their needs. Her insight and passion will be invaluable as we work to improve the lives of the more than 30 million Americans affected by rare diseases,” said NORD Chief Executive Officer Pamela Gavin.\n\nIsenberg, whoretired this year as Head of Global Public Affairs at Sanofi’s Rare Blood Disorders unit,has extensive experience advancing patient access, shaping national advocacy and policy efforts, and building partnerships across industry, government, and nonprofit sectors.\n\n“I am deeply honored to join NORD’s Board of Directors and to contribute to the critical work of elevating patient voices, driving thoughtful health policy, and creating collaborative solutions that improve outcomes for the entire rare disease community,” Isenberg said.\n\nBased inMinneapolis,Isenberg has focused extensively on rare blood disorders. Previous roles include Vice President of Policy, Advocacy, and Government Education at the Hemophilia Federation of America and Head of U.S. Field Advocacy at biopharmaceutical company Shire (later acquired by Takeda), where she partnered closely with bleeding disorder patient organizations.\n\nIn addition to her advocacy work, Isenberg brings extensive board and governance experience. She has served on the boards of the University of Minnesota YMCA, the Cowles Dance Theatre, and Women Winning. She was a staff member of major public boards, including the University of Minnesota Board of Regents and the Metropolitan Council.\n\nIsenberg holds a Bachelor of Arts in Speech Communication from the University of Minnesota.\n\nTo learn more about NORD’s Board of Directors, visitrarediseases.org/about-us/board-of-directors.\n\nAbout the National Organization for Rare Disorders\n\nFounded in 1983, the National Organization for Rare Disorders (NORD®) is a leading independent, nonpartisan, nonprofit and patient advocacy organization dedicated to improving the health and lives of over 30 million Americans living with rare diseases. In partnership with more than 350 disease-specific member patient organizations, NORD drives progress in rare disease research, care, and policy.\n\nCheryl Herbert, Vice President, Marketing & Communications |media@rarediseases.org", "url": "https://rarediseases.org/kim-isenberg-joins-board-of-directors/", "summary": "Posted December 8, 2025 by NORD\n\nNORWELL, Mass.,Dec. 8, 2025—The National Organization for Rare Disorders (NORD®), a leading rare disease patient advocacy organization, today announced the appointment...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T15:53:13.201713", "content_length": 3041}
{"title": "National Organization for Rare Disorders Adds Seven Rare Disease Centers of Excellence Nationwide", "date": "2025-12-03", "author": "Connor Rice", "categories": ["Featured News", "Medical Affairs", "Press Releases"], "content": "Posted December 3, 2025 by NORD\n\nNORD’s growing network,now 46institutions strong,representsacoordinatednationwideefforttostrengthenrare disease careand research collaboration\n\nNORWELL, Mass.,Dec. 3,2025 —The National Organization for Rare Disorders (NORD®) today announced the addition of seven leading academic medical and research centers to its nationalNORD®Rare Disease Centers of Excellence Network, expanding collaboration to improve care and accelerate research for the more than 30 million Americans living with rare conditions.\n\nWith these new members, the network now includes 46 institutions across 28 states and Washington, D.C., working together to shorten diagnostic timelines, advance groundbreaking research, train the next generation of rare disease specialists, and close persistent gaps in equitable access to care.\n\n“NORD is proud to welcome seven new leading institutions committed to driving breakthroughs and expanding the frontlines of rare disease care and research,” said Pamela K. Gavin, NORD Chief Executive Officer. “As our network grows, we remain focused on ensuring that everyone living with a rare disease, regardless of condition or location, can receive a timely diagnosis, access expert care, and participate in cutting-edge research.”\n\nThe seven new Rare Disease Centers of Excellence are:\n\n•Cedars-Sinai Rare Disease Advocacy, Research & Excellence in Care (California)\n\n•Children’s Hospital Los Angeles & Keck NORD Center of Excellence for Rare Disorders (California)\n\n•The New Jersey Center for Rare Disorders at Rutgers University (New Jersey)\n\n•NYU Langone Health – NORD Rare Disease Center of Excellence (New York)\n\n•Oregon Health & Science University Center of Excellence for Rare Diseases (Oregon)\n\n•Rare Disease Center of Excellence at Children’s Mercy, The University of Kansas Medical Center, and The University of Kansas Health System (Kansas)\n\n•University of California, Davis Health Center of Excellence for Rare Disorders (California)\n\nUniting Expertise to Solve Complex Rare Disease Challenges\n\nLaunched in 2021, the NORD Rare Disease Centers of Excellence Network provides a national infrastructure for improving care and research across all rare diseases, accelerating progress that would otherwise be unattainable.\n\nThe average rare disease diagnosis takes five to seven years, often requiring multiple specialists, extensive testing, and significant financial resources, all while conditions progress. Even after diagnosis, patients face challenges accessing expert care and opportunities to participate in clinical trials.\n\n“Our network is creating a system that strengthens rare disease patient care and accelerates research for all individuals with rare diseases, no matter where you live or your socioeconomic background,” said Tracey Sikora, NORD Vice President of Research and Clinical Programs.\n\nEach center undergoes NORD’s rigorous designation process, meeting benchmarks for multidisciplinary staffing, patient education, physician training, and research engagement.\n\nAcademic medical and research institutions interested in joining the Network canlearn more and apply here.\n\nAbout the National Organization for Rare Disorders\n\nFounded in 1983, the National Organization for Rare Disorders (NORD®) is a leading independent, nonpartisan, nonprofit patient advocacy organization dedicated to improving the health and lives of over 30 million Americans living with rare diseases. In partnership with more than 350 disease-specific member patient organizations, NORD drives progress in rare disease research, care, and policy.", "url": "https://rarediseases.org/national-organization-for-rare-disorders-adds-seven-rare-disease-centers-of-excellence-nationwide/", "summary": "Posted December 3, 2025 by NORD\n\nNORD’s growing network,now 46institutions strong,representsacoordinatednationwideefforttostrengthenrare disease careand research collaboration\n\nNORWELL, Mass.,Dec. 3,2...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T15:54:39.447504", "content_length": 3590}
{"title": "Guest Blog: How Collaboration Drives Early Diagnosis and Better Outcomes During Infantile Spasms Awareness Week", "date": "2025-12-01", "author": "Connor Rice", "categories": ["Guest Blogs", "Members"], "content": "Posted December 1, 2025 by NORD\n\nIn this NORD Guest Blog, two NORD Member patient organizations,TSC Alliance&Dup15q Alliance, discuss the importance of infantile spasms awareness, the symptoms to look out for, and how their organizations and 40 others successfully partnered to form the Infantile Spasms Action Network (ISAN).\n\nInfantile Spasms Awareness Week (ISAW), held annually from December 1–7, is a call to action to protect infant brain health. What began as a coordinated awareness push rooted in the simple yet powerful “STOP” mnemonic has evolved into a global movement, reaching tens of millions of caregivers, clinicians, researchers, and advocates. Today, ISAW is driven by the collective power of theInfantile Spasms Action Network (ISAN), a coalition of 42 patient organizations — including the TSC Alliance and Dup15q Alliance — aligned around one goal: ensuring every child with infantile spasms receives fast, accurate diagnosis and immediate treatment.\n\nHow to STOP Infantile Spasms\n\nInfantile spasms (IS) are rare seizures that affect roughly 1 in 2,000 children and can cause lifelong developmental consequences if not recognized and treated quickly. These spasms often appear as subtle, easily missed movements, such as head drops, body crunches, a sudden stiffening, or wide-eyed blinks. Because IS can be mistaken for reflux, colic, or a startle reflex, delays in diagnosis are tragically common. Each day of delayed diagnosis increases the risk of permanent damage to a child’s developing brain.\n\nDuring ISAW, the Infantile Spasms Action Network (ISAN) does a concentrated awareness effort centered around the STOP Infantile Spasms mnemonic:\n\nS – See the SignsSubtle head drops, sudden crunching movements, jerks, or wide-eyed blinks.\n\nT – Take a VideoBecause spasms often occur in clusters, a brief recording can help clinicians identify them quickly.\n\nO – Obtain a DiagnosisAn EEG is essential to confirm the abnormal brain wave pattern characteristic of IS.\n\nP – Prioritize TreatmentEarly intervention — ideally within 7 days — is critical to prevent long-term developmental harm.\n\nThis simple, memorable tool has helped ISAN reach more than 195 million people since its launch, transforming IS recognition across caregiver, clinician, and digital communities worldwide.\n\nInfantile Spasms Within the TSC + Dup15q Community\n\nToday, ISAW continues to serve as a platform for education, advocacy, research awareness, and community empowerment. Each participating organization amplifies the message through its own channels and within its disease-specific communities — making the campaign stronger than any single organization could achieve alone.\n\nInfantile spasms represent one of the most significant neurological risks for babies diagnosed withtuberous sclerosis complex.Approximately 30% of infants with TSC develop infantile spasms, often beginning between birth and two years old.\n\nBecause many children with TSC are diagnosed at or before birth (due to cardiac rhabdomyomas or other early indicators), parents and providers often know from day one that a baby is at elevated risk for IS. Moreover, vigabatrin, an antiseizure medication, is an effective first-line treatment for infants with TSC and infantile spasms. This presents a powerful opportunity: proactive monitoring, parent education, and early EEG surveillance can dramatically accelerate diagnosis and treatment.\n\nThe TSC Alliance is deeply committed to advancing early recognition and improving outcomes, including through support of the landmarkPREVeNT Trial (Preventing Epilepsy Using Vigabatrin in Infants with TSC). While babies in the study who were treated preventatively with vigabatrin did not have improved cognitive outcomes or delayed onset or lowered the incidence of focal seizures and drug-resistant epilepsy, preventative vigabatrin was associated with later time to onset and lower incidence of infantile spasms.\n\nThis work reflects the TSC Alliance’s long-standing mission to empower families with early detection tools, drive life-changing research, and ensure that every infant receives timely care.\n\nInfantile spasms are also a serious concern for children withDup15q syndrome, particularly those with the isodicentric (idic15) variant.Seizures occur in greater than 60% of children with Dup15q syndrome, and infantile spasms can be one of the earliest and most severe forms.\n\nDup15q families frequently face delayed diagnosis due to overlapping symptoms (low tone, reflux, developmental delays), misinterpretation of subtle movements, and limited awareness among general pediatric providers.\n\nThrough ISAW, the Dup15q Alliance provides families with urgently needed clarity, video examples, clinical guidance, and direct connections to epileptologists familiar with Dup15q-specific seizure presentations.\n\nThe organization also uses the week to amplify new research, support families navigating new diagnoses, and equip clinicians with the latest best practices for early detection and intervention.\n\nHow We Are Getting Involved This Infantile Spasms Awareness Week\n\nBoth our organizations will contribute to the national ISAW 2025 effort through digital campaigns, educational initiatives, new resources, and community engagement. Planned activities include:\n\nOngoing educational posts featuring IS warning signs, caregiver stories, and risk information\n\nClinical content for providers, including EEG red flags, first-line treatment guidance, and PREVeNT Trial updates\n\nDistribution of theISAWPartnerToolkitto clinics, advocacy organizations, influencers, and industry partners\n\nSpanish-language educational outreach for global families\n\nMini “micro-TED talks” featuring clinicians and caregivers discussing early detection and the lived experience of IS\n\nProvider-targeted posts urging rapid referral, EEG testing, and prescribing recognized first-line treatments\n\nNew family-friendly graphics and STOP mnemonic materials tailored for neurogenetic communities\n\nClinical guidance resources for pediatricians and neurologists encountering suspected IS in infants\n\nSocial media amplification across all platforms using the #ISAW2025 hashtag\n\nThe Power of Collective Advocacy\n\nISAW represents what is possible when rare disease communities unite around a shared mission. No single organization can solve the challenge of delayed infantile spasms diagnosis. But together, through coordinated messaging, shared tools, research collaboration, and synchronized national outreach, we can change outcomes for thousands of babies each year.\n\nThis December, as we join together, we reaffirm a simple truth: Awareness leads to recognition, recognition leads to diagnosis, and diagnosis leads to life-changing treatment.\n\nTogether, we can STOP Infantile Spasms.\n\nNORD invites you to participate in Infantile Spasms Awareness Week using theofficial toolkit, and by sharing this Guest Blog with your community.\n\nLearn more about the TSC Alliance attscalliance.organd learn more about the Dup15q Alliance atdup15q.org.\n\nIf you or someone you love is living with tuberous sclerosis complex (TSC) and would benefit from financial assistance to cover medical copays or travel and lodging assistance to reach a Center of Excellence or participate in a clinical trial, NORD RareCare can help. Explore our TSC Patient Assistance Programshere.", "url": "https://rarediseases.org/guest-blog-infantile-spasms-awareness-week/", "summary": "Posted December 1, 2025 by NORD\n\nIn this NORD Guest Blog, two NORD Member patient organizations,TSC Alliance&Dup15q Alliance, discuss the importance of infantile spasms awareness, the symptoms to look...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T15:57:04.618796", "content_length": 7339}
{"title": "NORD Launches New RFP for Patient Registries", "date": "2025-11-14", "author": "Connor Rice", "categories": ["Featured News", "Partnerships>RDCA-DAP", "Press Releases", "RDCA-DAP", "Registries", "Research", "Research>Registries"], "content": "Posted November 14, 2025 by NORD\n\nPartnerships>RDCA-DAP\n\nResearch>Registries\n\nImplementation of two new patient registries on the IAMRARE®platform funded by RDCA-DAP®\n\nDANBURY, Conn., Nov. 14, 2025 —The National Organization for Rare Disorders (NORD®), a leading national nonprofit serving more than 30 million Americans with rare diseases, announces a request for proposals (RFP) from nonprofit patient advocacy organizations for the implementation of two new patient registries on the IAMRARE®data and research platform.\n\nFunding is made available through the Rare Disease Cures Accelerator – Data and Analytics Platform (RDCA-DAP®), a collaborative agreement with the Critical Path Institute funded by the U.S. Food and Drug Administration (FDA).\n\nSuccessful applicants will actively work with NORD, beginning in April 2026, to create and launch a patient registry at a discounted annual rate of $5,000 for NORD Member Organizations (due at signing). NORD will build and host the registry site and will provide training to registry sponsors as they establish a registry advisory board, develop a study protocol, build and customize surveys, engage in an Institutional Review Board (IRB) process, and set criteria for the sharing of data collected by the registry.\n\nSuccessful applicants will meet the following criteria:\n\n501(c)(3) organization representing a community that meets the criteria for designation as a rare diseasePriority consideration will be given to NORD Member Organizations\n\nPriority consideration will be given to NORD Member Organizations\n\nCommitment and resources to begin registry work in April 2026 and run a natural history study for a minimum of five years, including:At least two staff members (paid or volunteer) with a combined minimum of 20 hours per week to dedicate to the registryA U.S.-based Principal Investigator (PI)Sufficient financial resources to support annual maintenance fees of approximately $5,000 per year (this cost is estimated and may change based on levels of support)\n\nAt least two staff members (paid or volunteer) with a combined minimum of 20 hours per week to dedicate to the registry\n\nA U.S.-based Principal Investigator (PI)\n\nSufficient financial resources to support annual maintenance fees of approximately $5,000 per year (this cost is estimated and may change based on levels of support)\n\nCommitment to the submission of data generated by the registry to the RDCA-DAP\n\nSupport from rare disease community and experts who will be able to contribute to the design and success of the project, including selecting disease-specific questions and patient engagement and retention\n\nHow to Apply:The application period opens on Nov. 15, 2025, at 9 a.m. ET, and closes on Jan. 10, 2026, at 11:59 p.m. ET. Accepted applicants will be notified by Feb. 1, 2026, and implementation will begin in April 2026.Apply here.\n\nAbout IAMRARE®The IAMRARE Platform hosts over 45 registries that are sponsored by patient advocacy organizations for the purpose of collecting patient reported data. For more information, visitrarediseases.org/iamrare-registry-program.\n\nAbout the National Organization for Rare DisordersFounded in 1983, the National Organization for Rare Disorders (NORD®) is a leading independent, nonpartisan, nonprofit patient advocacy organization dedicated to improving the health and lives of over 30 million Americans living with rare diseases. In partnership with more than 350 disease-specific member patient organizations, NORD drives progress in rare disease research, care, and policy.\n\nAbout RDCA-DAPRDCA-DAP is an FDA-sponsored initiative that provides a centralized and standardized infrastructure to support and accelerate rare disease characterization with the goal of accelerating therapy development. For information, visitc-path.org/programs/rdca-dap.", "url": "https://rarediseases.org/rdca-dap-rfp-2026/", "summary": "Posted November 14, 2025 by NORD\n\nPartnerships>RDCA-DAP\n\nResearch>Registries\n\nImplementation of two new patient registries on the IAMRARE®platform funded by RDCA-DAP®\n\nDANBURY, Conn., Nov. 14, 2025 —T...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T15:58:43.574334", "content_length": 3826}
{"title": "Living Rare, Living Stronger: A Day of Connection, Courage, and Community in Milwaukee", "date": "2025-11-14", "author": "Connor Rice", "categories": ["Events", "Featured News"], "content": "Posted November 14, 2025 by NORD\n\nFor one powerful day in Milwaukee, more than 110 people impacted by rare diseases — patients, caregivers, families, clinicians, and advocates — came together to share something simple yet profound: understanding.\n\nAt NORD’s Living Rare, Living Stronger event, Nov. 8 at the Milwaukee County Zoo, strangers became neighbors and conversations turned into lifelines. Together, we celebrated strength, swapped stories, learned from experts, and reminded each other that no one walks this rare journey alone.\n\n“We All Have a Story”\n\nThe day began with an emotional keynote from Henry “Hank” Heren, a rare cancer survivor and advocate who has spent six years defying a six-month prognosis. Sharing his journey through misdiagnosis, multiple clinical trials, and faith, Hank offered a message that resonated deeply: “Hope is a choice. It’s within our heart.”\n\nHe urged everyone to embrace listening as a lost art. “People aren’t always looking for someone to fix it,” he said. “They’re looking for someone to care.”\n\nHank’s story underscored the heart of advocacy: unity. From fragmented data to underfunded research, he reminded us that patients’ voices must lead the way.\n\n“The real heart of advocacy is you,” he said. “We’re a lot better when we’re together.”\n\nStronger – and Smarter – Together\n\nClinicians from NORD Rare Disease Centers of Excellence atChildren’s Wisconsin/Medical College of Wisconsinand theUniversity of Wisconsin Center for Rare Diseasesemphasized that progress in advancing rare disease diagnosis, care, and treatment depends upon collaboration between patients, families, and clinicians, as well as within and across institutions.\n\n“None of us is as smart as all of us,” said Donald Basel, MD, medical director of the genetics center at Children’s Wisconsin/Medical College of Wisconsin.\n\nPanelists took attendees behind the scenes to show how multidisciplinary teams help patients navigate years of misdiagnoses, stripping away old labels to see each case with fresh eyes. “Diagnosis is the cornerstone of advancing rare disease care,” said Brett Bordini, MD.\n\nStephen Meyn, MD, PhD, co-director of the University of Wisconsin Center for Rare Diseases, noted that diagnostic success has grown dramatically thanks to collaboration and emerging technologies. Yet gaps remain, especially for adults.\n\nApril Hall, PhD, MS, CGC, assistant professor and genetic counselor at the University of Wisconsin, explained that while families of children often have access to coordinated care and wraparound services through pediatric hospitals, those supports tend to fall away once patients transition to adult care. Adults may face challenges with insurance coverage, fragmented specialty care, and limited long-term management options. “Infrastructure is stronger for children than for adults,” she said. “We need to bridge that gap.”\n\nFinding Your Rare Village\n\nCommunity took center stage in a moving panel featuring patients Niki Grossheim and John Darrin Washburn and rare moms and caregivers Lani Knutson and Stacey Walthers Naffah, who shared advice on how to find – or create – a “rare village” of support.\n\nFor John, who lives with vision loss, connection came through others who shared his specific diagnosis: “I was seeking a community where I could share both hopes and fears.”\n\nStacey spoke of learning to accept help after years of being the helper. “Showing up for people is the most important thing,” she said.\n\nPeople who want to help may not know how or even what to say; Niki said it’s essential that patients and caregivers learn how to advocate for themselves. “Don’t be afraid to say your needs.”\n\nPanelists also highlighted the crucial role of clinicians who take the time to hear what families are saying. When Lani suggested a sleep study based on what she’d learned from other rare disease families, her doctor listened. It led to a better care plan for her son. “Listening and collaboration — that’s what saves lives,” she said.\n\nGrassroots Advocacy\n\nIndividual voices drive change. The grassroots advocacy panel highlighted steps anyone can take, from joining NORD’sRare Action Network (RAN)to participating in awareness campaigns and contacting lawmakers.\n\nJohn “JJ” Geeleher, a high school senior and Wisconsin’s RAN ambassador, shared how advocacy empowered him to share his journey withLacrimo-auriculo-dento-digital (LADD) syndrome. He reminded attendees that “you’re never too young to make a difference.” Social media, schools, and community events amplify the rare disease voice nationwide.\n\nIn the final discussion of the day, James Griffin, an advocate who lives withsickle cell disease,encouraged others to share their stories with lawmakers and patient advocacy organizations, reminding everyone that change begins with patient voices: “You’re the expert in your own journey.”\n\nCourtney Miles, a rare mom, described how her son Leo’s care plan connects school, specialists, and daily life. “The people at school — that’s my village,” she said.\n\nGretchen Heckel, a nurse at Children’s Wisconsin’s genetics clinic,acknowledged ongoing gaps in mental health support and the transition from pediatric to adult care. However, patient and caregiver voices are shaping real change: “It can feel like an uphill battle, but we are listening.”\n\nTiffany and Rowan’s Journey\n\nNORD’sTiffanySammons shared her family’s long road to diagnosing her son Rowan withCoffin-Siris Syndrome, an ultra-rare genetic disorder. “Sometimes not knowing what you’re dealing with is far more terrifying than having an answer,” she said, describing both the relief of a diagnosis and the weight of realizing there was no cure.\n\nDespite predictions he might never walk or speak, Rowan has surpassed every expectation — running, counting in two languages, and showing daily resilience. Discovering NORD gave Tiffany a path from fear to purpose, helping her become the advocate her son, and the broader rare disease community, needs: “NORD helped me find my voice.”\n\nLiving Rare, Living Stronger – Together\n\nFrom clinicians’ deep dives into diagnosis to families’ heartfelt conversations, Living Rare, Living Stronger reminds us what’s possible when hope, science, and humanity meet.\n\nAs Hank Heren put it, “Pain and difficulty will happen to all of us. But maybe, like me, you’ve found purpose through it.”\n\nFor one day in Milwaukee, and every day, the rare disease community proved that when we listen, connect, and stand together, we are all living rare and living stronger.\n\nRaise Your Voice\n\nEvery voice matters. Join NORD’sRare Action Networkto connect, advocate, and help shape a future where no one facing a rare disease feels alone.\n\nJoin the Rare Action Network", "url": "https://rarediseases.org/living-rare-living-stronger-milwaukee/", "summary": "Posted November 14, 2025 by NORD\n\nFor one powerful day in Milwaukee, more than 110 people impacted by rare diseases — patients, caregivers, families, clinicians, and advocates — came together to share...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T16:01:14.150506", "content_length": 6719}
{"title": "Congress: Reauthorize the Rare Pediatric Disease Priority Review Voucher Program", "date": "2025-11-10", "author": "Connor Rice", "categories": ["Advocacy", "Featured News"], "content": "Posted November 10, 2025 by NORD\n\nFirst published July 23, 2024. Updated November 10, 2025 with new content and revisions.\n\nThe National Organization for Rare Disorders (NORD) released anew reportshowing the undeniable effectiveness of the Rare Pediatric Disease Priority Review Voucher (RPD PRV) program, designed to incentivize the development of therapies for hard-to-study pediatric rare diseases. The RPD PRV has spurred the development of more than 60 safe and effective treatment options for rare pediatric diseases in the first 13 years of the program.\n\nRead NORD’s New Report Here\n\nView Our One-Page Explainer\n\nPatient Organization Leaders are Speaking Out:\n\nCheck out an op-ed from NORD’s President and CEO, Pam Gavin:The rare pediatric disease voucher program creates new treatments. I have new data to prove it.\n\nWatchthis four-minute video by Dr. Leslie Gordon, Co-Founder and Medical Director of the Progeria Research Foundation, a NORD Member organization, explaining the importance of the RPD PRV program for progeria research and other rare pediatric diseases.\n\nWatchthis three-minute video by Dr. Annette Bakker, CEO of the Children’s Tumor Foundation, also a NORD Member organization, explain the impact of the RPD PRV program for childhood cancer research, specifically neurofibromatosis.\n\nWatchthis 30-second video by Gina Glass, mom to a child with sickle cell disease and Executive Director of the Dreamsickle Kids Foundation, also a NORD Member organization, where she explains the need to reauthorize the RPD PRV program.\n\nWatch our Community Webinar: Why Saving the Rare Pediatric Disease Priority Review Voucher Program Matters\n\nThis webinar was held Wednesday, July 24, 2024, via Zoom, for all stakeholders in our rare disease community.Watch the webinar here.\n\nNearly 200 Patient Organizations Sign Letter to Congress Supporting Reauthorizing the Rare Pediatric Disease Priority Review Voucher Program\n\nLegislation has been introduced in the House and Senate to reauthorize this important program that has helped spur a safe and effective treatment option for almost 40 rare disease patient communities. To show the rare disease patient community’s strong support for the program, NORD led a patient organization sign-on letter to House and Senate leaders, urging their swift reauthorization of the program for at least five years through H.R.1262/ S.932, the Give Kids’ A Chance Act. Nearly 200 patient organizations signed on to the letter, which you canview here.\n\nMake Your Voice Heard\n\nContact your Representative TODAY and urge them to cosponsor the Creating Hope Reauthorization Act!Take action here.\n\nAs many as half of all people living with a rare disease are children, and theRarePediatricDiseasePriorityReviewVoucher (RPDPRV)program offer a crucial incentive for companies to develop therapies for these particularly challenging patient populations. The reauthorization for the program has lapsed, but you can still encourage your lawmakers to get this legislation over the finish line.\n\nIf you would like to get involved or share your story of how the pediatric PRV program helped you or someone you love, please email policy@rarediseases.org.\n\nBackground on Rare Pediatric Disease Priority Review Vouchers\n\nThe RPD PRV has helped spur rare disease drug development in pediatric populations and brought over 50 therapies to market with critical safety and dosing data specific to children.\n\nThe PRV program began in 2007 to address the unmet need of developing drugs for tropical diseases and was expanded in 2012 to include rare pediatric diseases. Under this program, companies that develop novel therapies for rare pediatric diseases can be awarded a PRV, which allows a sponsor to obtain priority review for a New Drug Application (NDA) or Biologic License Application (BLA) that would otherwise not qualify for priority review; it can also be sold or transferred to another manufacturer to obtain a priority review for their product.\n\nThe reauthorization for the program has lapsed, but you can still encourage your lawmakers to get this legislation over the finish line.\n\nTimely reauthorization is needed to support rare disease drug development\n\nAs of November 3rd, 2025, 63 PRVs have been awarded for 47 different rare pediatric diseases. Prior to the creation of the RPD PRV program, only four of these 47 rare pediatric diseases had any FDA–approved treatments.[1]\n\nIt is important to note that at the time of theGAOanalysis, the program had only been in place for 7 years; on average, it takes 10+ years to bring a new rare disease therapy to market.[2]The significant uptick in rare pediatric disease drug approvals in recent years[3]demonstrates the benefit of this incentive to the rare disease patient community, where more than 95% of rare diseases lack an FDA approved treatment.\n\nNORD would like to thank Senators Michael Bennet (D-CO) and Markwayne Mullin (R-OK), as well as Representatives Michael McCaul (R-TX), Doris Matsui (D-CA), Gus Bilirakis (R-FL), Kim Schrier (D-WA), Diana Harshbarger (R-TN), Lori Trahan (D-MA), Randy Weber (R-TX), Kathy Castor (D-FL), Mike Kelly (R-PA), Debbie Dingell (D-MI), and Dan Crenshaw (R-TX).\n\n[1]U.S. Government Accountability Office. (2020, January 31).Drug development: FDA’s Priority Review Voucher Programs. Drug Development: FDA’s Priority Review Voucher Programs | U.S. GAO.https://www.gao.gov/products/gao-20-251\n\n[2]Orphanet: About orphan drugs. (n.d.).https://www.orpha.net/consor/cgi-bin/Education_AboutOrphanDrugs.php?lng=EN\n\n[3]Center for Drug Evaluation and Research. (n.d.). CDER continuesto advance rare disease drug development. U.S. Food and DrugAdministration.https://www.fda.gov/about-fda/center-drug-evaluation-and-research-cder/accelerating-rare-disease-cures-arc-program", "url": "https://rarediseases.org/rare-pediatric-disease-prv-program/", "summary": "Posted November 10, 2025 by NORD\n\nFirst published July 23, 2024. Updated November 10, 2025 with new content and revisions.\n\nThe National Organization for Rare Disorders (NORD) released anew reportshow...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T16:03:32.042689", "content_length": 5792}
{"title": "Recognizing National Nurse Practitioner Week 2025 - Roshani's Story", "date": "2025-11-09", "author": "Connor Rice", "categories": ["Uncategorized"], "content": "Posted November 9, 2025 by NORD\n\nBy Roshani Kandel, DNP, ARNP, FNP-C, MPH\n\nAbout National Nurse Practitioner Week (November 9 to 15)\n\nNurses are a vital element in the health care ecosystem and health of the populations. The American Nurses Association defines nursing as the protection, promotion and optimization of health and abilities, prevention of illness and injury, alleviation of suffering through the diagnosis and treatment of human response, and advocacy in the care of individuals, families, communities and populations.\n\nNational Nurse Practitioner Week is celebrated annually during the second full week of November. This year, it falls November 9-15 and is a week to recognize and appreciate the vital role Nurse Practitioners (NPs) play in the health care system. According to the American Association of Nurse Practitioners, NPs assess patients, order and interpret diagnostic tests, make diagnoses, and initiate and manage treatment plans.\n\nBecoming a Nurse Practitioner\n\nI have been interested in pursuing a career in health care since I was in middle school. I did some nursing courses in Nepal followed by graduation with my Bachelor of Science in Nursing (BSN) in Bangladesh in 2010. While working with people in a hospital I realized how much we can help prevent them from getting sick, or prevent further complications with public health awareness, leading me to complete a Master of Public Health (MPH) program in 2012. After teaching community health courses to nurses in Nepal and watching my brother enter the medical field, I decided to pursue a career in advanced nursing and enrolled in the University of Iowa’s Doctor of Nursing Practice (DNP) program, with a Family Nurse Practitioner (FNP) specialty.\n\nConnection to Rare Disease\n\nWhen I had some health concerns with my teeth, one of professors suggested that it could be a rare disease, and that lead me to learn more about the National Organization for Rare Disorders (NORD). I found so much information from NORD about rare diseases that was very hard to find elsewhere. I decided to joinNORD’s State Ambassador programin March 2021 to raise awareness about rare disease and advocate for patients and families. In my personal and professional experience with rare disease, there are some things that can’t be changed with genetic formation and disease progression, but there is still so much that nurses can do to help both clinically and through advocacy.\n\nImportance to the Future of Public Health\n\nWith my experience, enthusiasm, and empathy for diverse populations, I am currently working in a federally qualified health center (FQHC) where I meet, help, and guide many people with the challenges they face – whether it’s lack of insurance, lack of resources, or issues accessing care. I’m amazed at how many people are in the community without a proper diagnosis of a rare disease, as well as how many people have a diagnosis but do not have access to quality care. Health care professionals working in primary care settings have opportunities to support people in accessing diagnoses and receiving appropriate care for their rare disease. We are also well-positioned to help our patients access resources – such as getting respite from caregiving or finding a specialist.", "url": "https://rarediseases.org/national-nurse-practitioner-week-2025/", "summary": "Posted November 9, 2025 by NORD\n\nBy Roshani Kandel, DNP, ARNP, FNP-C, MPH\n\nAbout National Nurse Practitioner Week (November 9 to 15)\n\nNurses are a vital element in the health care ecosystem and health...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T16:04:58.440155", "content_length": 3265}
{"title": "Media Advisory: Rare Disease “Zebra” Families Gathering at the Milwaukee County Zoo", "date": "2025-11-06", "author": "Connor Rice", "categories": ["Events", "Press Releases"], "content": "Posted November 6, 2025 by NORD\n\nNational Organization for RareDisorders(NORD®)Brings Together 100+Wis.Familiesfor a Day of Hope, Learning, and CommunityDuring National Family Caregivers Month\n\nWHAT:As National Family Caregivers Month shines a light on those who care for loved ones, the National Organization for Rare Disorders (NORD®) will bring together more than 100 Wisconsin families impacted by rare disease at the Milwaukee County Zoo this Saturday forLiving Rare, Living Stronger.®With over 500,000 Wisconsinites living with rare disease, the event offers emotional visuals and heartfelt stories as rare disease patients, caregivers, and advocates (the “zebras” of medicine) unite to navigate life with a rare disease.\n\nBEST PHOTO/VIDEO OPPORTUNITIES:\n\n8–9 a.m.:Breakfast, family arrivals, interviews with caregivers and patients\n\n9:10–9:30 a.m.:Veteran Henry “Hank” Heren shares his rare disease journey\n\n10:15–11 a.m.: Caregivers and families tell their stories in “Finding Your Rare Village”\n\n2 p.m.–on:Networking and zoo activities with rare families\n\nWHEN:Saturday, Nov. 8, 2025\n\nBreakfast: 8 a.m.\n\nProgram: 9 a.m.–2 p.m.\n\nZoo activities to follow\n\nWHERE:Milwaukee County Zoo – Zoofari Conference Center, 9715 West Bluemound Road, Milwaukee, Wis., 5322\n\nWHY IT MATTERS:More than 30 million Americans —includingmore than 500,000 Wisconsinites— live with a rare disease. Many rely on family caregivers who confront medical, emotional, and financial challenges. DuringNational Family Caregivers Monththis November, NORD’s event offers tools, expert guidance, and community connections to support those who care for rare loved ones.\n\nPamela K. Gavin, CEO, NORD\n\nLocal advocates, patients, and caregivers, including:John “JJ” Geeleher, a high school senior and rare disease advocate living with the rare genetic disorderLADD SyndromeJames Griffin, a rare disease advocate and author living withsickle cellLani Knutson, Legislative Advocacy Team lead forCure CMD; rare mom and caregiverCourtney Miles, rare mom and caregiver\n\nJohn “JJ” Geeleher, a high school senior and rare disease advocate living with the rare genetic disorderLADD Syndrome\n\nJames Griffin, a rare disease advocate and author living withsickle cell\n\nLani Knutson, Legislative Advocacy Team lead forCure CMD; rare mom and caregiver\n\nCourtney Miles, rare mom and caregiver\n\nExperts fromNORD Rare Disease Centers of ExcellenceatChildren’s Wisconsin,the Medical College of Wisconsin, and theUniversity of Wisconsin\n\nLearn more about the Living Rare, Living Stronger event atlivingrare.org.\n\nMEDIA RSVP:To attend and/or schedule interviews with speakers or attendees, please contact: Jackie Avial, Director of Content, NORD,javial@rarediseases.org, 475-203-7025\n\nABOUT NORD:Founded in 1983, the National Organization for Rare Disorders (NORD®) is a leading independent, nonpartisan, nonprofit patient advocacy organization dedicated to improving the health and lives of over 30 million Americans living with rare diseases. In partnership with more than 350 disease-specific member patient organizations, NORD drives progress in rare disease research, care, and policy.Learn more.", "url": "https://rarediseases.org/media-advisory-rare-disease-zebra-families-gathering-at-the-milwaukee-county-zoo/", "summary": "Posted November 6, 2025 by NORD\n\nNational Organization for RareDisorders(NORD®)Brings Together 100+Wis.Familiesfor a Day of Hope, Learning, and CommunityDuring National Family Caregivers Month\n\nWHAT:A...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T16:06:45.390673", "content_length": 3151}
{"title": "Racing for Answers: Annie’s Journey to Raise Awareness for Acromegaly", "date": "2025-11-01", "author": "Connor Rice", "categories": ["Patient Stories", "Running for Rare"], "content": "Posted November 1, 2025 by NORD\n\nRunning for Rare\n\nMeet Annie – she’s passionate about the environment and is an accomplished marathon runner who has conquered the streets of New York City and is lacing up for the Chicago Marathon next.\n\nWhat you may not see is that behind the race medals, Annie lives withacromegaly. Today, in honor of Acromegaly Awareness Day, Annie is sharing the one thing she wants you to know about living with acromegaly:\n\nFor years, I was misdiagnosed, largely because of how society, and even medical professionals, expect “sickness” to look.\n\nAcromegaly is a rare disease that changes your appearance slowly over time. You might think of Andre the Giant, or Maurice Tillet, the wrestler whose features inspired the character Shrek. But here’s the reality: only about three in a million people have acromegaly, and it takes an average of 10 years to be properly diagnosed.\n\nThe symptoms creep in randomly and don’t always make sense together: headaches, joint pain, changes in facial structure, fatigue. It’s a puzzle that even experienced doctors struggle to piece together. I was “lucky” to get a diagnosis in five years, but even then, some doctors dismissed me with comments like, “You don’t look acromegalic.”\n\nFrom the outside, I look like I’m thriving. I run marathons. I live a full, active life. But what people don’t see is the pain, exhaustion, and fear that I carry on the inside.\n\nThat’s why awareness matters. For patients, awareness means being believed sooner, not dismissed with lines like:\n\n“You’re just stressed.”\n\n“Maybe you should exercise less.”\n\n“But you look great!”\n\nAnd for practitioners, awareness means looking beyond appearances to recognize the subtle but powerful ways acromegaly shows up.\n\nThis Acromegaly Awareness Day, I’m sharing my story to remind you: looking healthy doesn’t always mean being healthy. By spreading awareness, we can shorten the years of uncertainty and help people get answers — and care — faster. Everyone deserves an answer, even if the answer is rare.\n\nIf you live with acromegaly, or know someone who does, and are looking for resources and a supportive community, follow and reach out to NORD Member organizationsAcromegaly Community, Inc.and thePituitary Network Association.", "url": "https://rarediseases.org/annies-journey-acromegaly/", "summary": "Posted November 1, 2025 by NORD\n\nRunning for Rare\n\nMeet Annie – she’s passionate about the environment and is an accomplished marathon runner who has conquered the streets of New York City and is laci...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T16:07:55.883569", "content_length": 2263}
{"title": "From Voices to Breakthroughs: Celebrating the 2025 NORD Breakthrough Summit", "date": "2025-10-29", "author": "Connor Rice", "categories": ["Events", "Featured News"], "content": "Posted October 29, 2025 by NORD\n\nThe 2025 NORD®Rare Diseases & Orphan Products Breakthrough Summit®was more than a gathering. It was a declaration. Well over 800 patient advocates, families, researchers, clinicians, and industry showed up to drive progress for the 30 million-plus Americans living with rare diseases.\n\nAmid a government shutdown that has disrupted health care, slowed research, and strained complex systems, you came to the NORD Breakthrough Summit with questions – and a commitment to creating solutions.\n\nWhat makes the rare disease community remarkable is how we respond to the uncertainty we face every day: with persistence, creativity, and unwavering resolve. This was on full display during this year’s event, captured through our theme:From Voices to Breakthroughs.\n\nThroughout the event, we asked:What are you raising your voice for?The answers were moving, diverse, and deeply inspiring. Keep reading to delve into our key takeaways and discover how you can keep the momentum going.\n\nView Event Photos\n\nVoices That Echoed\n\nFrom the main stage to one-on-one moments, voices rose for:\n\nPatients and families leadingresearch and treatment development from the start and staying at the center of every decision.\n\nSmarter, more flexible rare disease pathwaysthat allow regulatory decisions to consider the full patient experience,even when data is limited. For example, the newly createdFood and Drug Administration Commissioner’s National Priority Voucher pilot program,which reduces review times to 1-2 months from 10-12 months. Speakers on the Navigating the Regulatory Landscape panel heralded this as promising, although the impact on other applications remains to be seen.\n\nIncreased and sustainable fundingto accelerate rare disease discoveries and deliver life-saving treatments faster and more widely.\n\nPolicies that work for rare diseases,including renewing the Rare Pediatric Disease Priority Review Voucher (RPD PRV), which incentivizes companies to develop treatments for children with rare diseases.\n\nAccess for all, everywhere,ensuring every person can participate in clinical trials, receive care, and benefit from new treatments, no matter where they live.\n\nWhole-person care,including mental health support for patients and caregivers, recognizing the full experience of living with a rare condition.\n\nRegistered attendees have access to session recordings in the event app. If you missed the event,don’tworry! Session recordings will be made available for purchase in December.Join NORD’s email listso youdon’tmiss a moment.\n\nAdvancing Breakthroughs\n\nBreakthroughs highlighted during the event included:\n\nAn approved therapy for Barth Syndrome:After a decade of patient-driven research and advocacy, including natural history studies, expanded access, and tailored endpoints, the Food and Drug Administration (FDA) in September granted accelerated approval for Stealth BioTherapeutics’ therapy forthis ultra-rare condition.\n\nAI is speeding up rare disease drug discovery:AI has significantly reduced early-stage drug development timelines, and AI-predicted molecules have successfully moved into clinical trials, including for rare conditions likeneurofibromatosis type 1 (NF1).\n\nSensory restoration through gene therapy:Regeneron Pharmaceuticals’ gene therapy targeting congenital hearing loss successfully restored hearing in children, marking one of the first demonstrations of sensory restoration through gene therapy and offering new hope beyond cochlear implants.\n\nPotential for bipartisan progress:Staff from the offices of Rep. Gus Bilirakis (R-FL) and Rep. Doris Matsui (D-CA), both members of the House committee overseeing much of the nation’s health care legislation, emphasized a shared commitment to advancing policies that support the rare disease community. They noted a particular interest in returning to bipartisan efforts like the Accelerating Kids’ Access to Care Act of 2025, which both lawmakers co-sponsored and which continues to enjoy broad cross-party support.\n\nWe are stronger together:The NORD Breakthrough Summit underscored the power of community — when one rare disease community experiences progress, we all move forward. From fast friendships formed among those who truly understand, to youth advocates like Micah, who foundedTransplant Teenzso no other kids would experience the lack of peer support he faced after receiving a heart transplant, we united in our shared mission.\n\nMoments That Moved Us\n\nFrom powerful testimonies to joyful moments of connection, these highlights captured the heart of the rare disease community. You are why we continue to raise our voices and push for breakthroughs. Here’s a glimpse of some of the moments that moved us at the 2025 Breakthrough Summit.\n\nSmashing Pumpkins (not the band)After sharing what it’s like to live withmucopolysaccharidosis type I (MPS I)on the Summit stage youth panel, Christopher Hohn didn’t stop there. He and his brother Jacob led a late-night rally of dedicated advocates – including fellow youth panelist, Avery Garrison, NORD Chief Executive Pamela Gavin, and NORD Chief Strategy & Operations Officer Kelly Esperias – to head outside to literally “smash out MPS” by smashing pumpkins together. It got loud, it got joyful, and thanks to our parent clean-up squad, D.C. streets were restored to their original sparkle. Advocacy with a pumpkin twist.\n\nWhat Comes NextThe 2025 NORD Breakthrough Summit mayhave ended, but our movement is every day. What makes this event so powerful isn’t only the sessions and the speakers, but how many of you show up, year after year.\n\nShowing up is the first step, and speaking up is the second. Change happens when our voices unite and we take the third, fourth, and more next steps together. Because until every rare disease has a treatment — or treatments — we are not slowing down. And we cannot do this alone.\n\nAlone we are rare. Together we are strong. And together, we are driving progress.\n\nHere’show to keep showing up for the rare disease community:\n\nRaise your voice:Save rare disease pediatric innovation andurge your legislatorsto reauthorizethe Rare Pediatric Disease Priority Review Voucher Program before the end of the year.\n\nMeet us in Milwaukee:Get expert advice and make lasting connections to help you as you navigate life with a rare disease at theLiving Rare, Living Strongerpatient and family event in Milwaukee on Nov. 8.\n\nDive into rare science and rare solutions:Mark April 14-15, 2026, on your calendars for the second annualNORD Rare Disease Scientific Symposium, an opportunity for researchers, clinicians, industry leaders, and advocates to push boundaries and bridge gaps across the rare disease landscape.\n\nReturn to D.C.:Save the date for next year’sBreakthrough Summit, Oct. 25-27, 2026, in Washington, D.C., so we can continue raising our voices and taking critical next steps together.\n\nYour voice sparked something powerful. Let’s keep raising it untileveryrare disease community sees the breakthroughs they deserve.\n\nThank you for being part of our community. We also thank all of our 2025 Breakthrough Summit sponsors, including Platinum SponsorsSanofiandTakeda Pharmaceuticalsand Gold SponsorTravere Therapeutics, for their generous support.", "url": "https://rarediseases.org/2025-nord-breakthrough-summit/", "summary": "Posted October 29, 2025 by NORD\n\nThe 2025 NORD®Rare Diseases & Orphan Products Breakthrough Summit®was more than a gathering. It was a declaration. Well over 800 patient advocates, families, researche...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T16:10:36.380884", "content_length": 7257}
{"title": "NORD Unveils IAMRARE Mobile App Companion to IAMRARE Registry Platform", "date": "2025-10-28", "author": "Connor Rice", "categories": ["Featured News", "Press Releases", "Registries", "Research"], "content": "Posted October 28, 2025 by NORD\n\nOn-the-go apphelps patients and caregivers share health informationto support rare disease research\n\nThe National Organization for Rare Disorders (NORD®), a leading national nonprofit serving more than 30 million Americans with rare diseases, has launched a mobile app to make participating in critical research studies even more accessible for patients and caregivers.\n\nThe mobile app, available from Apple’sApp StoreandGoogle Play, is a companion to the NORD IAMRARE®Registry Platform, which hosts multiple community-driven natural history studies and collects data on lived experiences that registry sponsors can share with researchers to advance new treatments. With approximately 95% of 10,000 known rare diseases lacking approved treatments, scientific breakthroughs are urgently needed.\n\n“The IAMRARE mobile app is a game-changer,” said NORD Chief Executive Officer Pamela K. Gavin. “By making it easier for patients to participate and stay engaged, critical data can be collected faster and with higher quality. That means studies move forward more quickly, discoveries come sooner, and more approved therapies come to market.”\n\nUsing the same log-in credentials, this companion app immediately connects caregivers and patients to the IAMRARE Rare Disease study they have joined. More than half of patients and caregivers access the IAMRARE platform from their phones, so the IAMRARE mobile app has been designed to provide a speedier connection, simpler navigation, and helpful reminders.\n\nNORD, with input from physicians and the U.S. Food & Drug Administration (FDA), established theIAMRARE data and research platformin 2014 to facilitate patient-powered natural history studies.\n\nSince the program’s inception, more than 70 patient-powered natural history studies have been created or are in development, representing more than 20,000 participants and 165 rare diseases. IAMRARE data have been cited in more than 30 peer-reviewed publications and have contributed toone approved therapy.\n\nIAMRARE empowers patients as partners throughout all phases of rare disease research, from study initiation and to co-design to implementation and data ownership. By harnessing the power of data and patient-reported experiences, IAMRARE studies are informing clinical trials, new treatment methods, and transformative change for the rare disease community.\n\nDownload the IAMRARE mobile app from theApp StoreandGoogle Play.", "url": "https://rarediseases.org/nord-unveils-iamrare-mobile-app/", "summary": "Posted October 28, 2025 by NORD\n\nOn-the-go apphelps patients and caregivers share health informationto support rare disease research\n\nThe National Organization for Rare Disorders (NORD®), a leading na...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T16:11:35.850979", "content_length": 2456}
{"title": "Senator Amy Klobuchar Joins Rare Disease Community at National Gathering", "date": "2025-10-21", "author": "Connor Rice", "categories": ["Press Releases"], "content": "Posted October 21, 2025 by NORD\n\nOct. 21, 2025 — U.S. Senator Amy Klobuchar joined theNational Organization for Rare Disorders (NORD®)Rare Diseases & Orphan Products Breakthrough Summit®today, offering encouragement to an audience of rare disease advocates, researchers, families, and clinicians.\n\nIn her remarks, Senator Klobuchar emphasized that rare diseases are not abstract statistics, but personal and pressing issues that affect millions of families across the country. She cited over a decade of bipartisan support for increased National Institutes of Health (NIH) funding, highlighted the growing role of artificial intelligence in accelerating research, and discussed her collaborative efforts with the Food and Drug Administration (FDA) to improve the review process for rare disease treatments.\n\nThe Senator also spoke about several rare disease-focused legislative efforts, the Accelerating Kids Access to Care Act and the Give Kids a Chance Act, including the reauthorization of theRare Pediatric Disease Priority Review Voucher Program— all of which she vowed to continue pushing through Congress.\n\nClosing her remarks on a personal note, Senator Klobuchar shared how her daughter’s early medical challenges first introduced her to the rare disease community. She pledged her continued commitment to advancing rare disease research and improving patient access to treatment, and she encouraged the rare disease community to keep raising their voices.\n\n“You have changed lives. We have made progress, and I don’t want to look at that progress in the rearview. We are moving forward together,” Sen. Klobuchar said.\n\nPhoto credit: John Halpern for the National Organization for Rare Disorders.", "url": "https://rarediseases.org/senator-amy-klobuchar-joins-rare-disease-community-at-national-gathering/", "summary": "Posted October 21, 2025 by NORD\n\nOct. 21, 2025 — U.S. Senator Amy Klobuchar joined theNational Organization for Rare Disorders (NORD®)Rare Diseases & Orphan Products Breakthrough Summit®today, offerin...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T16:12:28.591299", "content_length": 1705}
{"title": "NORD Breakthrough Summit Features Bold New Ideas for the Future of Rare Disease Care, Policy and Research", "date": "2025-10-14", "author": "Connor Rice", "categories": ["Events", "Featured News", "Research"], "content": "Posted October 14, 2025 by NORD\n\nLightning round poster presentations highlight cutting-edge insights on issues ranging from Medicaid coverage disparities to real-world data innovation\n\nThe future of rare disease advancements will take center stage at the National Organization for Rare Disorders (NORD®)Rare Disease and Orphan Products Breakthrough Summit®, Oct. 19-21 in Washington.\n\nNORD is proud to announce the top researchers selected for theLightning Rounds Poster Presentationssession. Chosen from a competitive field of submissions by academics, researchers, industry, government agencies, health care professionals, patient organizations, and students, the winning posters represent the forefront of innovation and advocacy in the rare disease space.\n\nThe Lightning Rounds Poster Presentations, slated for Oct. 20, are a highlight of the annual NORD Breakthrough Summit. This year’s selections reflect urgent and evolving priorities for the rare disease community, from addressing systemic barriers to genetic testing and harnessing real-world data for faster therapeutic discovery to creating collaborative care models that place patients at the center of innovation.\n\n“These seven posters demonstrate what’s possible when research, policy, and advocacy come together with a shared commitment to innovation and patient empowerment,” saidPamela K. Gavin, NORD Chief Executive Officer. “We’re proud to showcase such forward-thinking work at the NORD Breakthrough Summit and look forward to seeing how these insights drive collaboration and change for the rare disease community.”\n\nThe winning posters and their authors are:\n\nPartnering for Education at a Turning Point in the Desmoid Tumor Landscape(Presenting Author: Tariqa Ackbarali, PhD, CHCP,Medlive)This case study explores the power of partnership through a collaboration among Medlive, NORD, and theDesmoid Tumor Research Foundationto provide free, accredited, digital education. The outcomes revealed the impact on clinical teams, improving their ability to diagnose and treatdesmoid tumors.\n\nThis case study explores the power of partnership through a collaboration among Medlive, NORD, and theDesmoid Tumor Research Foundationto provide free, accredited, digital education. The outcomes revealed the impact on clinical teams, improving their ability to diagnose and treatdesmoid tumors.\n\nThe Castleman Disease Expert Panel: A Collaborative Model That Could Be Replicated to Improve Clinical Outcomes for Rare Disease Patients(Presenting Author: Madison Ahearn, BS, MHA,Castleman Disease Collaborative Network)This presentation explores how an expert panel was developed to assist physicians in improving diagnosis, treatment, and overall patient care forCastleman diseasethrough open, discussion-based reviews of complex cases, while demonstrating a scalable model to improve outcomes across other rare diseases.\n\nThis presentation explores how an expert panel was developed to assist physicians in improving diagnosis, treatment, and overall patient care forCastleman diseasethrough open, discussion-based reviews of complex cases, while demonstrating a scalable model to improve outcomes across other rare diseases.\n\nAccelerating Rare Disease Discovery: Leveraging Real-World Data for Phenotypic Characterization and Therapeutic Target Identification(Presenting Author: Sanjay Ahuja, PhD,Regal Intel)Real-world data captured via electronic health records, patient registries, insurance claims, and more holds the key to accelerating the discovery and development of much-needed orphan products, this study concludes.\n\nReal-world data captured via electronic health records, patient registries, insurance claims, and more holds the key to accelerating the discovery and development of much-needed orphan products, this study concludes.\n\nMedicaid Coverage Gaps in Genetic Testing Lead to Health Disparities for Rare Disease(Presenting Author: Shannon Belmont, MPH, JM,GeneDx)This study reveals a “significant and persistent disparity” in access to outpatient exome and genome sequencing between individuals with commercial insurance and those covered by Medicaid. Since rare disease diagnoses already take years, these gaps may further delay diagnosis and treatment for medically underserved and vulnerable populations.\n\nThis study reveals a “significant and persistent disparity” in access to outpatient exome and genome sequencing between individuals with commercial insurance and those covered by Medicaid. Since rare disease diagnoses already take years, these gaps may further delay diagnosis and treatment for medically underserved and vulnerable populations.\n\nStreamlining Patient Engagement in Rare Disease: A Multi-Sponsor Advisory Panel Pilot(Presenting Author: Shana Dodge, PhD,The Association for Frontotemporal Degeneration)This pilot program brought together multiple companies to co-sponsor an advisory panel led by a patient advocacy organization, designed to efficiently gather insights from people affected byfrontotemporal degeneration(FTD). The initiative streamlines input from a small patient population, reduces burden on individuals, and ensures clinical research reflects the real-world priorities of those living with FTD.\n\nThis pilot program brought together multiple companies to co-sponsor an advisory panel led by a patient advocacy organization, designed to efficiently gather insights from people affected byfrontotemporal degeneration(FTD). The initiative streamlines input from a small patient population, reduces burden on individuals, and ensures clinical research reflects the real-world priorities of those living with FTD.\n\nQuantifying Health Benefits of Orphan Drugs(Presenting Author: Genevieve Lyons, MSc,Alexion, AstraZeneca Rare Disease)This study finds that orphan drugs, especially those with single or multiple rare disease indications, offer significantly greater health benefits than non-orphan drugs, highlighting the importance of informed policymaking that incentivizes scientific innovation.\n\nThis study finds that orphan drugs, especially those with single or multiple rare disease indications, offer significantly greater health benefits than non-orphan drugs, highlighting the importance of informed policymaking that incentivizes scientific innovation.\n\nSpotlight on Familial Chylomicronemia Syndrome (FCS): Leveraging the Power of Individual Journeys Toward Collective Action—Voice of the Patient Paper(Presenting Author: Alexandra Roeser,Arrowhead Pharmaceuticals)To better understand the lived experience of those affected byfamilial chylomicronemia syndrome(FCS), Arrowhead Pharmaceuticals hosted a series of patient and caregiver convenings. Key insights highlight urgent needs for greater provider awareness and offer actionable strategies to improve diagnosis, care, and advocacy.\n\nTo better understand the lived experience of those affected byfamilial chylomicronemia syndrome(FCS), Arrowhead Pharmaceuticals hosted a series of patient and caregiver convenings. Key insights highlight urgent needs for greater provider awareness and offer actionable strategies to improve diagnosis, care, and advocacy.\n\nThe Lightning Rounds Presentations, scheduled forOct. 20 from 12-12:30 p.m. ET,is a dynamic, rapid-fire format designed to showcase the most compelling poster presentations in under five minutes each. This session is a cornerstone of the annual NORD Breakthrough Summit, offering visibility to rising voices and game-changing ideas across the rare disease space.\n\nTheNORD Breakthrough Summit, taking place at the Grand Hyatt in Washington, is an annual event dedicated to accelerating progress for the over 30 million Americans living with rare diseases.Virtual registration is also available.\n\nThis year’s theme,“From Voices to Breakthroughs,”underscores the power of lived experience in shaping scientific and policy progress. Featured speakers include patient advocates, industry executives, researchers at the forefront of scientific innovation, and regulatory leaders.", "url": "https://rarediseases.org/nord-breakthrough-summit-features-bold-new-ideas-for-the-future-of-rare-disease-care-policy-and-research/", "summary": "Posted October 14, 2025 by NORD\n\nLightning round poster presentations highlight cutting-edge insights on issues ranging from Medicaid coverage disparities to real-world data innovation\n\nThe future of ...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T16:14:24.259705", "content_length": 8012}
{"title": "NORD Scientific Symposium Full Session Recordings Available Now", "date": "2025-10-06", "author": "Ahnecia Edouard-Gary", "categories": ["Education"], "content": "Posted October 6, 2025 by NORD\n\nTheNORD Rare Disease Scientific Symposiumbrought together a dynamic community of rare diseaseclinicians, researchers, and thought leadersfor an unforgettable gathering of ideas, insights, and inspiration.\n\nIf you missed it (or want to relive it), you’re in luck:We’ve just released all full-length session recordings online!Access starts at $25 for non-attendees and is free to those who attended the event in person. Get a FREE sneak peek ofthree standout sessions, or purchase full accesshere. And keep reading for a glimpse into our inaugural Scientific Symposium.\n\nEarlier this year, the National Organization for Rare Disorders (NORD®) convened its inauguralNORDRare Disease Scientific Symposiumin Washington, D.C., bringing together over 200 clinicians, researchers, patient advocates, regulators, and industry representatives. Over the course of two days, attendees participated in a series of presentations and conversations centered on the theme ofdriving progress in rare disease research through innovation and collaboration. More than 40 speakers discussed how the rare disease community is advancing new approaches to rare disease science. For clinicians and researchers, this was a unique opportunity to hear from scientific fields and medical subspecialties outside their typical area of focus.\n\nThe common thread among these differing areas of expertise was the unique challenge in conducting research in all rare diseases.  This year’s event highlighted three central themes: innovation in clinical trial design, the importance of patient-centered data, and the power of collaboration. These priorities shaped a program that introduced new ideas, showcased success stories, and highlighted the urgent need for coordinated action.\n\nInnovative Clinical Trials\n\nThe Symposium opened with a clear call to action: clinical trials for rare diseases must evolve to meet the realities of small populations and high unmet need. In this section chaired byDr. PJ Brooks(National Institutes of Health), speakers highlighted how adaptive platforms, basket trials, and N-of-1 strategies are being utilized in current clinical studies, and how they may apply to additional rare diseases. One of the most compelling examples came fromDr. Kiran Musunuru(University of Pennsylvania, a NORD Rare Disease Center of Excellence), who shared the story of “Baby KJ,” an infant with CPS1 deficiency who received a personalized gene-editing treatment. Dr. Musunuru introduced the concept of a master protocol IND for an “umbrella of umbrellas” clinical trial framework; this would enable more efficient testing of customized interventions using a shared therapeutic platform to treat multiple gene variants. Other presenters demonstrated how trial strategies can be tailored for rare diseases, such as disease-specific scoring to assess efficacy in complex basket trial designs. Throughout these discussions, a consistent message emerged: rare disease trials must be creative, nimble, and rooted in deep understanding of both the molecular and lived experience of disease.\n\nRegulatory Perspective: Highlights from the FDA\n\nSenior FDA officials joined a plenary panel to share agency-wide insights on regulatory innovation in rare disease drug development. This panel, which featured experts from FDA’s Center for Drug Evaluation and Research (CDER) and Center for Biologics Evaluation and Research (CBER) as well as the Rare Disease Innovation Hub, provided an opportunity for direct dialogue with federal regulators. The panel addressed the growing role of biomarkers as surrogate endpoints, especially in support of accelerated approval pathways. The panelists affirmed the agency’s openness to both frequentist and Bayesian methods, noting the relevance of Bayesian frameworks for small, adaptive trials and external control data. The panel emphasized the importance of early, frequent interaction with FDA teams to navigate complex design, endpoint, and statistical issues, particularly in trials for very small populations or bespoke interventions.\n\nThe Symposium also featured a keynote address byDr. Vinay Prasad, Director of the FDA’s Center for Biologics Evaluation and Research (CBER). Dr. Prasad (complimentary access to his session is available here) emphasized that all rare disease patients deserve access to both transformational therapies and meaningful incremental advances, and highlighted examples ranging from targeted oncology treatments to bespoke gene-editing approaches like the CPS1 deficiency “Baby KJ” case presented by Dr. Musunuru and recently featured in theNew England Journal of Medicine. Dr. Prasad affirmed the FDA’s openness to innovative trial designs, real-world data, and flexibility, particularly in ultra-rare and life-threatening conditions, and underscored the agency’s commitment to transparency, responsiveness, and patient empowerment.\n\nPatient-Centered Data and the Emergence of Artificial Intelligence\n\nThe importance of patient-centered data collection and real-world evidence was a second theme of the Symposium. From early natural history studies to advanced use of data, multiple sessions explored how diverse data sources are shaping both research and regulatory decision-making. Presenters highlighted models that integrate longitudinal patient experience, biospecimens, and qualitative inputs such as interviews and focus groups to build rich, multidimensional datasets. These efforts aim not only to inform science, but also to align research with the priorities and realities of the rare disease community. A session chaired byMark Skinneremphasized that registries are not endpoints, but tools to empower decision-making by all stakeholders: patients, regulators, payers, and sponsors alike. Several speakers underscored the importance of designing these systems in partnership with patients, ensuring that governance structures, data elements, and research questions reflect community needs.\n\nThe Symposium also explored the use of AI and machine learning in rare disease research. Case studies demonstrated how computational phenotyping and natural language processing can surface diagnostic insights from unstructured EHR data, while some speakers cautioned that algorithmic bias, data quality, and interpretability remain critical barriers to trust and adoption, particularly in rare conditions where datasets are sparse.\n\nCollaboration as the Catalyst: Building Global, Cross-Sector Bridges\n\nIn rare disease research, the power of collaboration cannot be understated. Discussions highlighted the need for multi-stakeholder, cross-border partnerships to overcome the intrinsic challenges of rare disease research, including patient scarcity, data fragmentation, and funding limitations. Speakers from Europe’sMetabERN, theChildren’s Tumor Foundation, theCritical Path Institute, andARPA-Hshared how they are leveraging shared infrastructure and collaborative approaches to catalyze new discoveries. Examples ranged from multinational platform trials to community-developed disease ontologies and co-governed registries embedded in clinical care. The message was clear: no one organization or sector can solve rare disease challenges alone. By aligning scientific, regulatory, advocacy, and industry efforts, the community can not only accelerate therapeutic development but also ensure that research is meaningful, inclusive, and equitably distributed.\n\nLooking Ahead: A Call to Stay Engaged\n\nAs the Symposium drew to a close, what participants celebrated was not only scientific insights and policy discussions, but also the connections formed across disciplines and communities. Many attendees noted the rare opportunity to engage directly with peers from outside their usual circles, sparking new conversations and potential partnerships. Above all, the event reinforced the power of collaboration as a driver of change.\n\nThe 2025 NORD Rare Disease Scientific Symposium affirmed that the rare disease field is entering a new era, in which innovation, patient-driven evidence, and strategic partnerships are not just aspirations, but realities taking shape. We look forward to continuing these conversations in the months ahead and welcoming even more members of the rare disease community to join us next year.\n\nSee for yourself – access the Scientific Symposium video librarytoday!", "url": "https://rarediseases.org/nord-scientific-symposium-full-session-recordings-available-now/", "summary": "Posted October 6, 2025 by NORD\n\nTheNORD Rare Disease Scientific Symposiumbrought together a dynamic community of rare diseaseclinicians, researchers, and thought leadersfor an unforgettable gathering ...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T16:16:56.884682", "content_length": 8369}
{"title": "Giving in a Changing Landscape: Why 2025 Matters for Rare Disease Families", "date": "2025-10-02", "author": "Connor Rice", "categories": ["Featured News"], "content": "Posted October 2, 2025 by NORD\n\nIn July 2025, Congress enacted one of the most significant federal tax reforms in recent memory, often referred to as the “One Big Beautiful Bill” (OBBBA). Buried within this sweeping legislation are provisions that directly affect charitable giving. For philanthropists, foundations, and families alike, these changes will reshape how generosity is measured and rewarded.\n\nHere’s the most important thing to know: 2025 is a singular year of opportunity.It is the final year before new rules take effect, rules that add floors and caps to charitable deductions, limiting the benefit of giving for many high-capacity donors. This makes 2025 a moment to act boldly, with both purpose and strategy.\n\nFor the rare disease community, the timing could not be more urgent. Families are waiting for answers. Researchers are on the edge of discovery. New therapies are within reach. The decisions donors make in this window year will shape what progress looks like in the decade ahead.\n\nWhy 2025 Is a Window Year\n\nIn 2025, charitable gifts are still governed by the more favorable current rules:\n\nFull deductibility (subject to existing caps)\n\nNo “floor” limiting deductions\n\nFull leverage of the donor’s marginal tax rate\n\nThat changes in 2026. Consider a donor with an adjusted gross income (AGI) of $10 million who contributes $1 million to a qualified charity:\n\nIn 2025, the full $1 million is deductible under current rules.\n\nIn 2026, $50,000 (0.5% of AGI) will not be deductible due to the new floor, and the value of the deduction will be capped at 35%, even if the donor’s bracket is higher.\n\nThis shift could redirect hundreds of thousands of dollars away from charitable causes — unless donors plan ahead and act now.\n\nWhat’s Changing in 2026\n\nHere are the main changes to expect:\n\nA 0.5% floor. Charitable deductions will only apply to giving above 0.5% of AGI.\n\nA 35% deduction cap. Even donors in higher brackets will be limited to a 35% benefit for charitable deductions.\n\nA new deduction for non-itemizers. Up to $1,000 (individual) or $2,000 (joint) in cash gifts to public charities. (Donor-advised funds and supporting organizations are excluded.)\n\nThe 60% AGI cap for cash gifts remains in place.\n\nWhat Donors Can Do Now\n\nPhilanthropic advisors are already urging donors to treat 2025 as a year for intentional generosity. Strategies to consider include:\n\nAccelerating or “bundling” gifts that might otherwise be spread across several years.\n\nDonating appreciated assets like stock or real estate, with proper appraisals and documentation.\n\nUsing donor-advised funds (DAFs) to secure the deduction now while distributing gifts later.\n\nPrioritizing precise documentation, since IRS scrutiny is expected to intensify.\n\nBeyond the Numbers\n\nTax law can feel technical, but at its core, this is about people. Every charitable gift represents compassion, hope, and the belief that tomorrow can be brighter than today.\n\nAt NORD, we see the ripple effect of generosity every day. A family finds answers after years of searching. A patient connects with life-changing care. A researcher receives the funding to take a promising idea into the lab. None of this happens without donors who choose to act.\n\nThat’s why this window year matters so much. With more than 10,000 known rare diseases, most without a treatment, every dollar, every breakthrough, every act of generosity is urgent.\n\nIf you are considering your giving strategy, we encourage you to speak with your advisors and explore how 2025 can be the year to make your most meaningful gift. It is a chance to maximize both the impact of your generosity and its tax efficiency before the new rules take effect.\n\nAnd please know: you are not navigating this alone and we are also here as a resource. If you like, NORD’s Director of Philanthropy, Jenna Scheer, would be happy to run a scenario with you (or with your advisor) to see how much additional gift you might consider in 2025 to optimize your tax benefit. Please contact Jenna directly atJScheer@rarediseases.orgif you’d like to explore that.\n\nWe are on the cusp of a rare disease revolution. The science is ready. The tools exist. Awareness is growing. Without investment, progress will stall and families will wait another decade for answers. We cannot let that happen.\n\nJoin the movement.Your gift is not charity. It is an investment in progress for millions.\n\nThank you again for your generosity and your partnership. Future stability and impact depend on bold and informed giving decisions.\n\nExplore all ways to contribute to NORD here, and consider making your gift today.", "url": "https://rarediseases.org/giving-in-a-changing-landscape/", "summary": "Posted October 2, 2025 by NORD\n\nIn July 2025, Congress enacted one of the most significant federal tax reforms in recent memory, often referred to as the “One Big Beautiful Bill” (OBBBA). Buried withi...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T16:18:24.620040", "content_length": 4625}
{"title": "NORD CEO Statement on Rare Cancer Day", "date": "2025-09-30", "author": "Ahnecia Edouard-Gary", "categories": ["Advocacy", "Rare Cancer Coalition"], "content": "Posted September 30, 2025 by NORD\n\nRare Cancer Coalition\n\nToday, on Rare Cancer Day, I am proud to recognize the 30 organizations that make up theNORD Rare Cancer Coalition.\n\nRare cancers are part of the family of more than 10,000 rare diseases. Every pediatric cancer is rare. Together, rare cancers represent one in four cancer diagnoses in the U.S. Nearly everyone knows a family member, friend, or colleague touched by a rare cancer – and that should concern us all.\n\nThe toll is devastating. At NORD, we see it every day: families with limited options, patients facing uncertainty, and communities mourning lives cut short. Investment in rare cancer research fuels progress not only for rare cancers but also for more common cancers and diseases. That’s why NORD is calling on Congress to increase National Institutes of Health (NIH) funding for rare cancer research.\n\nWe thank our Coalition members for their ongoing advocacy, and U.S. RepresentativesMike Kelly (R-PA), Brian Fitzpatrick (R-PA), Debbie Wasserman Schultz (D-FL), and Debbie Dingell (D-MI)for championing this year’s Rare Cancer Day resolution. May the day come when every cancer and rare disease has effective treatments and cures.\n\nAlone we are rare. Together we are strong.\n\nPamela GavinChief Executive OfficerNational Organization for Rare Disorders (NORD)", "url": "https://rarediseases.org/nord-ceo-statement-on-rare-cancer-day/", "summary": "Posted September 30, 2025 by NORD\n\nRare Cancer Coalition\n\nToday, on Rare Cancer Day, I am proud to recognize the 30 organizations that make up theNORD Rare Cancer Coalition.\n\nRare cancers are part of ...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T16:19:17.834871", "content_length": 1331}
{"title": "From Patient 3737 to Advocate: The Life-Changing Power of Clinical Trials", "date": "2025-09-30", "author": "Ahnecia Edouard-Gary", "categories": ["Rare Cancer Coalition", "Voices of Rare Cancer"], "content": "Posted September 30, 2025 by NORD\n\nRare Cancer Coalition\n\nVoices of Rare Cancer\n\nBy Melinda Bachini of the Cholangiocarcinoma Foundation\n\nIn April 2012, I walked into the National Cancer Institute (NCI) as Patient 3737. While not being called by my name may be impersonal, this number was a lifeline. It represented my place in a clinical trial — my last chance after standard treatments had failed. Fifteen years later, I am still here, enjoying my life as a mother, wife, grandmother, and patient advocate.\n\nI am alive today because I believe that we all need to contribute to scientific advancements.I wasn’t really taking a chance; I was doing what I believed was the logical next step in the face of this insurmountable challenge as a rare disease patient.\n\nCholangiocarcinoma, or bile duct cancer, is a brutal disease. It is often discovered only when it’s stage IV and treatments are difficult to effectively provide. By the time I was diagnosed, the tumor in my liver was so large it covered the right lobe. Initial surgery gave me a little precious time, but the cancer spread to my lungs, and chemotherapy was not proving to be a long-term solution.\n\nBy 2012, my tumors were growing aggressively, and I could barely climb a few stairs without becoming breathless. It was during one sleepless night after paying medical bills that my online search led me to a clinical trial for “tumor-infiltrating lymphocyte therapy” led by Dr. Steven Rosenberg and his team at NCI. I applied — what did I have to lose?\n\nThe process was daunting, but the cancer was worse. It involved sequencing my tumor to find immune cells that could attack the cancer. Those cells were extracted, multiplied in a lab, and reinfused into my body. The treatment was cutting-edge and not yet proven for cholangiocarcinoma. I was willing to try. For six months, my tumors shrank. For the next six, they stayed stable.\n\nThat clinical trial didn’t just give me time. It gave me back my life.\n\nThe Case for Clinical Trials\n\nMy story brings hope, but it also highlights a difficult truth: too few patients participate in clinical trials. Only 5-7% of adult cancer patients enroll in trials despite their potential to transform lives. For many, the barriers appear steep: lack of understanding, geographic limitations, fear of the unknown, and financial concerns. Even more troubling are the myths that persist: that trials are a “last resort” or that they treat patients as “guinea pigs.” These misconceptions cost lives.\n\nIn honor of Rare Cancer Day — Sept. 30, 2025 — I’m telling my story to share hope as well as a difficult truth: Too few patients participate in clinical trials.\n\nClinical trials are not just about testing treatments. They are about answering complex questions that accelerate progress. They are essential for discovering cures and improving\n\nthe quality of care for all patients. Trials like the one I participated in not only advanced science but also created a treatment blueprint that paved the way for saving others.\n\nBut still patients from underrepresented communities are disproportionately excluded from trials due to logistical, cultural, and socioeconomic barriers. The result? These patients are missing access to many treatment options, and we miss critical data to address disparities and develop better treatments for everyone.\n\nBreaking Down Barriers\n\nAt the Cholangiocarcinoma Foundation, where I am now Chief Patient Officer, we aim to debunk myths and help eliminate trial participation obstacles.\n\nWe believe in the power of advocacy and education. Patients and caregivers should be empowered to explore and access trials. Likewise, health care providers should be educated on clinical trials and provide these options to patients. Policymakers, researchers, and industry should emphasize urgency. From expanding geographic reach to offering financial support, we need bold action to make trials more accessible.\n\nWhy This Matters\n\nMy journey from Patient 3737 to survivor to advocate is a testament to what’s possible when patients and scientists work together. Patients aren’t just getting access to potentially effective treatments; they are also leading the way in groundbreaking discoveries.\n\nI urge everyone — whether you’re a cancer patient, a caregiver, or just interested in the future of health care — to learn more about clinical trials. Challenge the myths, and ensure every patient has access, because no one should ever be just a number, and every number has the potential to become a story of survival, like me.\n\nAbout the Cholangiocarcinoma Foundation\n\nThe Cholangiocarcinoma Foundation is a global organization dedicated to curing cholangiocarcinoma (bile duct cancer) and enhancing patients’ quality of life. Through innovative methodologies, partnerships, and support programs, CCF connects patients and caregivers to resources, peer mentors, and support groups, while also fostering scientific discovery through an annual research fellowship program. Please find more information atcurecca.org.", "url": "https://rarediseases.org/from-patient-3737-to-advocate-the-life-changing-power-of-clinical-trials/", "summary": "Posted September 30, 2025 by NORD\n\nRare Cancer Coalition\n\nVoices of Rare Cancer\n\nBy Melinda Bachini of the Cholangiocarcinoma Foundation\n\nIn April 2012, I walked into the National Cancer Institute (NC...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T16:20:34.097108", "content_length": 5029}
