{"title": "Statement from Pamela Gavin, CEO, National Organization for Rare Disorders (NORD) on the Senate Failure to Approve the Give Kids a Chance Act By Year-End", "date": "2025-12-18", "author": "sroberts", "categories": ["Advocacy", "Featured News"], "content": "Posted December 18, 2025 by NORD\n\nThe Senate’s failure to advance the Give Kids a Chance Act through unanimous consent is deeply disappointing.\n\nFor more than a year, thousands of rare disease advocates have engaged lawmakers across both parties to urge passage of the Give Kids a Chance Act, which includes reauthorization of the Rare Pediatric Disease Priority Review Voucher Program and passage of other critical policies for children with rare conditions. This legislation has broad bipartisan support, is budget-neutral, and has a proven track record of accelerating the development of treatments for children who often have no other options.\n\nAllowing this bill to expire slows and risks halting progress for families who are already waiting far too long for diagnoses and therapies. For children with rare diseases, delays are not abstract. They are measured in irreversible losses of physical body functions, neurological damage, time, and life itself.\n\nAt a time when our nation needs leaders to come together and set aside differences to do what is right, it is unfortunate that this opportunity was missed. This could have been a meaningful victory for more than 30 million Americans living with rare diseases.\n\nWhen the Senate returns in January, NORD will be back on Capitol Hill working with lawmakers in both chambers to move this legislation forward without delay. The rare disease community has been clear, consistent, and united. We urge Congress to act swiftly to ensure that children with rare diseases are not left behind.", "url": "https://rarediseases.org/statement-from-pamela-gavin-ceo-national-organization-for-rare-disorders-nord-on-the-senate-failure-to-approve-the-give-kids-a-chance-act-by-year-end/", "summary": "Posted December 18, 2025 by NORD\n\nThe Senate’s failure to advance the Give Kids a Chance Act through unanimous consent is deeply disappointing.\n\nFor more than a year, thousands of rare disease advocat...", "source_website": "rarediseases.org", "scraped_at": "2026-01-04T17:08:41.062505", "content_length": 1543}
